/*==============================================================================
                Copyright(C) 1997-2019.  Sinowealth Tech. Co., Ltd.
--------------------------------------------------------------------------------
Project Name  : IICDRIVER.c
Description   :
Notice        :
			 1:
			 2:
Author        : James.wang (email: James.wang@sinowealth.com)
Start Date    : 2015/11/08
Approve Date  :
Version       : V0.0
Function List :
             1:
             2:
RevisionHistory:
Rev#  CheckSum    Date     Author     Comments(Function+Date)
-----+--------+----------+---------+------------------------------------------
0.0     XXXX   2015/11/08 james.wang Just build the file
==============================================================================*/

//-------------------------------------------------------------------------------
#ifndef  IICDRIVER_C
	#define  IICDRIVER_C
#endif
//-------------------------------------------------------------------------------

//---------------

#include "config.h"



////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: Delay1ms
** 函数描述: I2C总线操作延时  
** 输入参数: 无 
** 输出参数: 无
** 返    回：无    
*******************************************************************************************/
void Delay1ms(unsigned char Count)
{
	unsigned char i,j;

	for(i=0;i<Count;i++)
	{
		for(j=0;j<240;j++)
		{
			I2C_delay();				
		}
	}
}


////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: I2C_delay
** 函数描述: I2C总线操作延时  
** 输入参数: 无 
** 输出参数: 无
** 返    回：无    
*******************************************************************************************/
void I2C_delay(void)      
{
	unsigned char i;
	
	for(i=0 ;i<3; i++)    
	_nop_();
}


////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: I2C_start
** 函数描述: I2C总线起始位  
** 输入参数: 无 
** 输出参数: SCL=0,SDA=0
** 返    回：无    
*******************************************************************************************/
void I2C_start(void)
{
    TRIS_SCL_HI();
    SCL = 1;
    TRIS_SDA_LO();

    I2C_delay();
    TRIS_SDA_HI();
    SDA=0;

    I2C_delay();

    SCL=0;	
}  

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: I2C_stop
** 函数描述: I2C总线停止位  
** 输入参数: 无 
** 输出参数: SDA\SCL为输入I/O
** 返    回：无    
*******************************************************************************************/
void I2C_stop(void)
{
    unsigned char i;
    TRIS_SCL_HI();
    TRIS_SDA_LO();

    for (i=0; i<16; i++)       
    {
        if (SDA)    break;

        SCL = 1;

        I2C_delay();

        if (SDA)    break;

        SCL = 0;

        I2C_delay();
    }

    SCL = 0;
    TRIS_SDA_HI();

    SDA = 0;   
    I2C_delay();
    SCL = 1;
    I2C_delay();

    TRIS_SDA_LO();
    TRIS_SCL_LO();
}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: I2C_WR1byte
** 函数描述: 向I2C总线发1个8位数据  
** 输入参数: 待发数据Data 
** 输出参数: SCL=0,SDA为输入I/O
** 返    回：0-无应答位/1-有应答位    
*******************************************************************************************/
bit I2C_WR1byte(unsigned char Data)
{
   unsigned char i;

    for (i=0; i<8; i++)        
    {
        if (Data&0x80) 
		{
            TRIS_SDA_LO();
		}
        else
        {
			TRIS_SDA_HI();
            SDA = 0;
        }

        I2C_delay();
        SCL = 1;
        I2C_delay();
        SCL = 0;

        Data<<=1;
    }

    I2C_delay();

    TRIS_SDA_LO();

    SCL = 1;
    i=0;

    while (SDA)             //等待应答位 
    {
        I2C_delay();

        if (++i>8)
        {
            SCL = 0;
            return(0);
        }
     }

    SCL = 0;
    return(1);
}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: I2C_RD1byte
** 函数描述: I2C总线接收1个8位数据  
** 输入参数: 位ACK,0-反馈应答,1-无反馈应答 
** 输出参数: ACK决定SDA的输入输出属性和SCL点平状态 
** 返    回：所读数据Data    
*******************************************************************************************/
unsigned char I2C_RD1byte(bit ACK)
{
    unsigned char  i,Data=0;

    TRIS_SDA_LO();
    for (i=0; i<8; i++)         
    {
        I2C_delay();

        SCL = 1;

        I2C_delay();

        Data<<=1;
        Data|=SDA;
        SCL = 0;
    }

    I2C_delay();

    if (!ACK)                   
    {
        TRIS_SDA_HI();

        SDA = 0;
       
        I2C_delay();

        SCL = 1;

        I2C_delay();

        SCL = 0;
    }
    return(Data);
}