/*==============================================================================
                Copyright(C) 1997-2019.  Sinowealth Tech. Co., Ltd.
--------------------------------------------------------------------------------
Project Name  : BCDANDHEXSUB.c
Description   :
Notice        :
			 1:
			 2:
Author        : James.wang (email: James.wang@sinowealth.com)
Start Date    : 2015/11/08
Approve Date  :
Version       : V0.0
Function List :
             1:
             2:
RevisionHistory:
Rev#  CheckSum    Date     Author     Comments(Function+Date)
-----+--------+----------+---------+------------------------------------------
0.0     XXXX   2015/11/08 james.wang Just build the file
==============================================================================*/

//-------------------------------------------------------------------------------
//#ifndef  BCDANDHEXSUB_C
//	#define  BCDANDHEXSUB_C
//#endif
//-------------------------------------------------------------------------------

//---------------




#include "config.h"
#include "Headconfig.h"




const uint8 code XQtable[]={6,2,2,5,0,3,5,1,4,6,2,4};



////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: WriteToHex
** 函数描述: 将多字节BCD数据转换为HEX数据是将16，32位数据按BCD码存放于以address为地址的区域内
** 输入参数: BCDdata:要处理的BCD数据
** 输出参数: 处理后的HEX
*******************************************************************************************/
uint32 WriteToHex(uint8 *BCDdata,uint8 num)
{
   uint8 i,k;
   uint32 tmp,tmp1;

   tmp=0;
   for(i=num;i>0;i--)
   {
      tmp1=BCD2HEX(*(BCDdata+i-1));
	  for(k=0;k<i-1;k++)
	  {
        tmp1*=100;
      }
      tmp=tmp+tmp1;
   }
   return tmp;
}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: BCD2toINT
** 功能描述: 将数据按BCD格式写入数组将多字节HEX码转换成BCD码
** 入口参数:
** 出口参数: 无
*******************************************************************************************/
unsigned int BCD2toINT(unsigned char *BCD)
{
    return ((unsigned int)BCD2HEX(*BCD)*100 + (unsigned int)BCD2HEX(*(BCD + 1)));
}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: INTtoBCD2
** 功能描述: 将数据按BCD格式写入数组将多字节HEX码转换成BCD码
** 入口参数:
** 出口参数: 无
*******************************************************************************************/
// void INTtoBCD2(unsigned int INT, unsigned char *BCD)
// {
//    if ( INT > 9999 )
//    {
//       *(BCD+1) = 0x00;
//       *BCD = 0x00;
//       return;
//    }

//    *(BCD+0) = HEX2BCD( (char)(INT/100) );
//    *(BCD+1) = HEX2BCD( (char)(INT%100) );
// }

 ////////////////////////////////////////////////////////////////////////////////////////////
/********************************************************************************************
** 函数名称: Write_Array
** 功能描述: 将数据按BCD格式写入数组将多字节HEX码转换成BCD码
** 入口参数:
** 出口参数: 无
********************************************************************************************/
// void Write_Array (uint8 *address,uint32 tdat,uint8 num)
// {
//    switch (num)
//    {
//       case 4:
//          tdat %= 100000000;
//          *(address+3) = HEX2BCD(tdat/1000000);
//       case 3:
//          tdat %= 1000000;
//          *(address+2) = HEX2BCD(tdat/10000);
//       case 2:
//          tdat %= 10000;
//          *(address+1) = HEX2BCD(tdat/100);
//       case 1:
//          tdat %= 100;
//          *address = HEX2BCD(tdat);
//          break;
//       default:
//          break;
//    }
// }

////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************
** 函数名称: Write_ArrayRes
** 功能描述: 将数据按BCD格式写入数组将多字节HEX码转换成BCD码
** 入口参数:
** 出口参数: 无
******************************************************************************************/
//void Write_ArrayRes (uint8 *address,uint32 tdat,uint8 num)
//{
//   switch (num)
//   {
//      case 4:
//         tdat %= 100000000;
//         *(address) = HEX2BCD(tdat/1000000);
//      case 3:
//         tdat %= 1000000;
//         *(address+1) = HEX2BCD(tdat/10000);
//      case 2:
//         tdat %= 10000;
//         *(address+2) = HEX2BCD(tdat/100);
//      case 1:
//         tdat %= 100;
//         *(address+3) = HEX2BCD(tdat);
//         break;
//      default:
//         break;
//   }
//}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: HEX2BCD
** 函数描述: 将2字节HEX数据转换为一个字节的BCD数据
** 输入参数: BCDdata:要处理的BCD数据
** 输出参数: 处理后的HEX
*******************************************************************************************/
uint8 HEX2BCD(uint8 Hexdata)
{
	uint8 Temp;

	Temp=(Hexdata/10)<<4;
	Temp+=Hexdata%10;

	return Temp;
}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: BCD2HEX
** 函数描述: 将2字节BCD数据转换为一个字节的HEX数据
** 输入参数: BCDdata:要处理的BCD数据
** 输出参数: 处理后的HEX
*******************************************************************************************/
uint8 BCD2HEX(uint8 BCDdata)
{
	uint8 Temp;

	Temp=(BCDdata>>4)*10;
	Temp+=BCDdata&0x0F;

	return Temp;
}

////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: BCDCheck
** 功能描述: 检查BUFF中是否为BCD码
** 入口参数:
** 出口参数: 无
*******************************************************************************************/
unsigned char BCDCheck(unsigned char *buff, unsigned char len)
{
	unsigned char i,flag,buf[2];
	flag = 1;
	for(i=0;i<len;i++)
	{
		buf[0] = buff[i]&0x0F;
		buf[1] = (buff[i]>>4)&0x0F;
		if((buf[0]>0x09)||(buf[1]>0x09))
		{
			flag = 0;
			break;
		}
	}
	return flag;
}
////////////////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************************
** 函数名称: DataToWeek
** 功能描述: 日期转换为星期
** 入口参数:
** 出口参数: 无
*******************************************************************************************/
unsigned char DataToWeek(unsigned char *ptr)
{
    unsigned char i1,i2,i3;

	i1=BCD2HEX(ptr[0]);
	i2=BCD2HEX(ptr[1])-1;
	i3=BCD2HEX(ptr[2]);

	i1=XQtable[i2]+i1+i3;

	if ((i2 >= 2) && !(i3&0x03)) i1++;
	i1=(i1+(i3-1)/4)%7;

	return(i1);
}