/*==============================================================================
            Copyright(C) 1997-2019.  Sinowealth Tech. Co., Ltd.
--------------------------------------------------------------------------------
Project No.   : XXX
File Name     : ADC..H
Description   :
              ；
              ；
Notice        :
             1:
             2:

Author        : James (email: james.wang@sinowealth.com)
Start Date    : 2015/11/08
Release Date  :
Approve Date  :
Version       : V1.0
CheckSum      : XXXX
Function List :
             1:
             2:

RevisionHistory:
Rev#  CheckSum   Date     Author     Comments(Function+Date)
-----+--------+----------+---------+--------------------------------------------
0.0 2015/11/08 James Just build the function
0.1
==============================================================================*/


//------------------------------------------------------------------------------
#ifndef  ADC_H
#define  ADC_H


#ifdef ADC_C
   #define  ADC_EXT
#else
   #define  ADC_EXT   extern
#endif
//------------------------------------------------------------------------------

//---------------------



/*******************************************************************************************
** 函数名称: Init_ADC
** 函数描述: 初始化ADC
** 输入参数: 无
** 输出参数: 无
*******************************************************************************************/
extern void Init_ADC(void);

/*******************************************************************************************
** 函数名称: Sample_PwrADC
** 函数描述: 采样电源AD
** 输入参数: speed:1是低速,0是高速
** 输出参数: 无
*******************************************************************************************/
extern void CheckPowerOn(void);
//extern void CheckPowerOff(void);

#endif
